Working With Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
dict = {
    'First score':[100,95,np.nan,95],
    'Second score':[30,45,56,np.nan],
    'Third score':[np.nan,40,80,90]
}

In [3]:
df = pd.DataFrame(dict)

In [4]:
df.isnull()

   First score  Second score  Third score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [5]:
data = pd.read_csv

In [6]:
df.dropna()

   First score  Second score  Third score
1         95.0          45.0         40.0

In [7]:
dict = {'First score':[100,90,np.nan,95],
        'Second score':[30,np.nan,45,56],
        'Third score':[52,40,80,98],
        'Fourth score':[np.nan,np.nan,np.nan,65]
}

In [8]:
df = pd.DataFrame(dict)

df.dropna()

   First score  Second score  Third score  Fourth score
3         95.0          56.0           98          65.0

In [9]:
dict = {'First score':[100,np.nan,np.nan,95],
        'Second score':[30,np.nan,45,56],
        'Third score':[52,np.nan,80,98],
        'Fourth score':[np.nan,np.nan,np.nan,65]
}

In [10]:
df = pd.DataFrame(dict)

In [11]:
df.dropna(how='all')

   First score  Second score  Third score  Fourth score
0        100.0          30.0         52.0           NaN
2          NaN          45.0         80.0           NaN
3         95.0          56.0         98.0          65.0